Documents/УведомлениеОПредоставленииПолномочийПредставителю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>УведомлениеОПредоставленииПолномочийПредставителю</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страхователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияИлиСтрокаБРО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраховательСотрудник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>160</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияКонтрагентФизлицоИлиСтрокаБРО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставительСотрудник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>160</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганыПФР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегНомерПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлВыгрузки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФИО</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СубъектыДоверенностиСтрахователя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фамилия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>60</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>60</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отчество</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>60</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>120</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СубъектыДоверенностиСтрахователя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭлПочты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>120</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Телефон</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РеквизитыСубъектов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СубъектыДоверенностиСтрахователя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегистрационныйНомерПФР</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеКраткое</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СНИЛС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УведомлениеОПредоставленииПолномочийПредставителю/Forms/ФормаВводаРеквизитов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДанных = Параметры.СтруктураДанных;
	
	Если СтруктураДанных.Свойство("ЮЛ") Тогда
		
		Элементы.ГруппаЮЛ.Видимость = Истина;
		Элементы.ГруппаФЛ.Видимость = Ложь;
		ВидОрганизации = "0";
		
		Если СтруктураДанных.Свойство("ТолькоПросмотрФормы") И СтруктураДанных.ТолькоПросмотрФормы Тогда
			Элементы.Наименование.ТолькоПросмотр				= Истина;
			Элементы.НаименованиеКраткое.ТолькоПросмотр			= Истина;
			Элементы.РегистрационныйНомерПФР.ТолькоПросмотр		= Истина;
			Элементы.ИНН.ТолькоПросмотр							= Истина;
			Элементы.КПП.ТолькоПросмотр							= Истина;
			Элементы.Телефон.ТолькоПросмотр						= Истина;
			Элементы.АдресЭлектроннойПочты.ТолькоПросмотр		= Истина;
			Элементы.ВидОрганизации.Доступность					= Ложь;
			
			Элементы.ФормаКнопкаСохранить.Доступность			= Ложь;
		КонецЕсли;
		
		Если СтруктураДанных <> Неопределено И СтруктураДанных.Свойство("Наименование") Тогда
			Наименование				= СтруктураДанных.Наименование;
			НаименованиеКраткое			= СтруктураДанных.НаименованиеКраткое;
			РегистрационныйНомерПФР		= СтруктураДанных.РегистрационныйНомерПФР;
			ИНН 						= СтруктураДанных.ИНН;
			КПП 						= СтруктураДанных.КПП;
			Телефон 					= СтруктураДанных.Телефон;
			АдресЭлектроннойПочты		= СтруктураДанных.АдресЭлектроннойПочты;
		КонецЕсли;
		
	Иначе
		
		Элементы.ГруппаЮЛ.Видимость = Ложь;
		Элементы.ГруппаФЛ.Видимость = Истина;
		ВидОрганизации = "1";
		
		Если СтруктураДанных.Свойство("ТолькоПросмотрФормы") И СтруктураДанных.ТолькоПросмотрФормы Тогда
			Элементы.ФИО.ТолькоПросмотр							= Истина;
			Элементы.РегистрационныйНомерПФРФЛ.ТолькоПросмотр	= Истина;
			Элементы.ИННФЛ.ТолькоПросмотр						= Истина;
			Элементы.СНИЛС.ТолькоПросмотр						= Истина;
			Элементы.ТелефонФЛ.ТолькоПросмотр					= Истина;
			Элементы.АдресЭлектроннойПочтыФЛ.ТолькоПросмотр		= Истина;
			
			Элементы.ФормаКнопкаСохранить.Доступность			= Ложь;
		КонецЕсли;
		
		Если СтруктураДанных <> Неопределено И СтруктураДанных.Свойство("ФИО") Тогда
			ФИО							= СтруктураДанных.ФИО;
			РегистрационныйНомерПФР		= СтруктураДанных.РегистрационныйНомерПФР;
			ИННФЛ 						= СтруктураДанных.ИНН;
			СНИЛС 						= СтруктураДанных.СНИЛС;
			Телефон 					= СтруктураДанных.Телефон;
			АдресЭлектроннойПочты		= СтруктураДанных.АдресЭлектроннойПочты;
		КонецЕсли;
		
	КонецЕсли;
	
	Заголовок = СтруктураДанных.Заголовок;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	Если НЕ СохранениеВозможно() Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидОрганизации = "0" Тогда
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("Наименование",			Наименование);
		СтруктураДанных.Вставить("НаименованиеКраткое",		НаименованиеКраткое);
		СтруктураДанных.Вставить("РегистрационныйНомерПФР",	РегистрационныйНомерПФР);
		СтруктураДанных.Вставить("ИНН",						ИНН);
		СтруктураДанных.Вставить("КПП",						КПП);
		СтруктураДанных.Вставить("Телефон",					Телефон);
		СтруктураДанных.Вставить("АдресЭлектроннойПочты",	АдресЭлектроннойПочты);
		СтруктураДанных.Вставить("ЭтоЮридическоеЛицо",		Истина);
	Иначе
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("ФИО",						ФИО);
		СтруктураДанных.Вставить("Фамилия",					Фамилия);
		СтруктураДанных.Вставить("Имя",						Имя);
		СтруктураДанных.Вставить("Отчество",				Отчество);
		СтруктураДанных.Вставить("Наименование",			ФИО);
		СтруктураДанных.Вставить("РегистрационныйНомерПФР",	РегистрационныйНомерПФР);
		СтруктураДанных.Вставить("ИНН",						ИННФЛ);
		СтруктураДанных.Вставить("СНИЛС",					СНИЛС);
		СтруктураДанных.Вставить("Телефон",					Телефон);
		СтруктураДанных.Вставить("АдресЭлектроннойПочты",	АдресЭлектроннойПочты);
		СтруктураДанных.Вставить("ЭтоЮридическоеЛицо",		Ложь);
	КонецЕсли;
	
	Закрыть(СтруктураДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОрганизацииПриИзменении(Элемент)
	
	Элементы.ГруппаЮЛ.Видимость = ?(ВидОрганизации = "0", Истина, Ложь);
	Элементы.ГруппаФЛ.Видимость = ?(ВидОрганизации = "0", Ложь, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ФИОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ФормаВводаФИО = РегламентированнаяОтчетностьКлиент.ПолучитьОбщуюФормуПоИмени("ФормаВводаФИО");
	
	ФормаВводаФИО.Фамилия 	= Фамилия;
	ФормаВводаФИО.Имя 		= Имя;
	ФормаВводаФИО.Отчество 	= Отчество;
	
	ФормаВводаФИО.ОписаниеОповещенияОЗакрытии =
		Новый ОписаниеОповещения("ФИОНачалоВыбораЗавершение", ЭтотОбъект);
	ФормаВводаФИО.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаВводаФИО.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ФИООчистка(Элемент, СтандартнаяОбработка)
	
	Фамилия 	= "";
	Имя 		= "";
	Отчество 	= "";
	
	ФИО = "";
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция СохранениеВозможно()
	
	Отказ = Ложь;
	
	ОчиститьСообщения();
	
	Если ВидОрганизации = "0" Тогда
		
		Если НЕ ЗначениеЗаполнено(Наименование) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не задано наименование организации.'"),,
				"Наименование",, Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НаименованиеКраткое) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не задано краткое наименование организации.'"),,
				"НаименованиеКраткое",, Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ИНН) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не задан ИНН организации.'"),,
				"ИНН",, Отказ);
		ИначеЕсли НЕ РегламентированнаяОтчетностьВызовСервера.ИННСоответствуетТребованиямНаСервере(
			ИНН, Ложь) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Указан некорректный ИНН организации.'"),,
				"ИНН",, Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(КПП) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не задан КПП организации.'"),,
				"КПП",, Отказ);
		ИначеЕсли СтрДлина(КПП) <> 9 Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Указан некорректный КПП организации.'"),,
				"КПП",, Отказ);
		КонецЕсли;
		
		Если НЕ ДокументооборотСКОКлиентСервер.ПроверитьРегистрационныйНомерПФР(РегистрационныйНомерПФР, Истина) Тогда
			ТекстСообщенияПользователю = ДокументооборотСКОКлиентСервер.ЗаменитьПФРиФССнаСФР(
				НСтр("ru = 'Регистрационный номер ПФР должен состоять из 12 цифр (ХХХ-ХХХ-ХХХХХХ)'"), Истина);
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				ТекстСообщенияПользователю,,
				"РегистрационныйНомерПФР",, Отказ);
		КонецЕсли;
			
		Если ЗначениеЗаполнено(Телефон) ИЛИ ЗначениеЗаполнено(АдресЭлектроннойПочты) Тогда
			Если НЕ ЗначениеЗаполнено(Телефон) И НЕ ЗначениеЗаполнено(АдресЭлектроннойПочты) Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не задан телефон организации.'"),,
					"Телефон",, Отказ);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(АдресЭлектроннойПочты) И НЕ ЗначениеЗаполнено(Телефон) Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не задан адрес электронной почты организации.'"),,
					"АдресЭлектроннойПочты",, Отказ);
			ИначеЕсли ЗначениеЗаполнено(АдресЭлектроннойПочты) Тогда
				ТекстОшибки = "";
				ЭлектроннаяПочта = СокрЛП(АдресЭлектроннойПочты);
				Если ДокументооборотСКОКлиентСервер.НайденыЗапрещенныеСимволы(
					ЭлектроннаяПочта,
					НСтр("ru = 'Адрес электронной почты '"),
					"АдресЭлектроннойПочты",
					Истина,
					ТекстОшибки) Тогда
					
					ОбщегоНазначенияКлиент.СообщитьПользователю((ТекстОшибки),,
						"АдресЭлектроннойПочты",, Отказ);
					
				ИначеЕсли НЕ ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(ЭлектроннаяПочта) Тогда
					
					Если НЕ СтрНайти(ЭлектроннаяПочта, "@") Тогда
						ОбщегоНазначенияКлиент.СообщитьПользователю(
							НСтр("ru = 'Некорректно указана электронная почта. Отсутствует символ @'"),,
							"АдресЭлектроннойПочты",, Отказ);
					Иначе
						ОбщегоНазначенияКлиент.СообщитьПользователю(
							НСтр("ru = 'Электронная почта содержит некорректные сочетания символов'"),,
							"АдресЭлектроннойПочты",, Отказ);
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru = 'Необходимо задать хотя бы один вид контактной информации.'"),,
				,, Отказ);
		КонецЕсли;
		
	Иначе
		
		Если НЕ ЗначениеЗаполнено(ФИО) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не задано ФИО индивидуального предпринимателя.'"),,
				"ФИО",, Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ИННФЛ) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не задан ИНН индивидуального предпринимателя.'"),,
				"ИННФЛ",, Отказ);
		ИначеЕсли НЕ РегламентированнаяОтчетностьВызовСервера.ИННСоответствуетТребованиямНаСервере(
			ИННФЛ, Истина) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru = 'Указан некорректный ИНН индивидуального предпринимателя.'"),,
				"ИННФЛ",, Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СНИЛС) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не задан СНИЛС индивидуального предпринимателя.'"),,
				"СНИЛС",, Отказ);
		ИначеЕсли СтрДлина(СНИЛС) <> 14 Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru = 'Указан некорректный СНИЛС индивидуального предпринимателя.'"),,
				"СНИЛС",, Отказ);
		КонецЕсли;
		
		Если НЕ ДокументооборотСКОКлиентСервер.ПроверитьРегистрационныйНомерПФР(РегистрационныйНомерПФР, Истина) Тогда
			ТекстСообщенияПользователю = ДокументооборотСКОКлиентСервер.ЗаменитьПФРиФССнаСФР(
				НСтр("ru = 'Регистрационный номер ПФР должен состоять из 12 цифр (ХХХ-ХХХ-ХХХХХХ)'"), Истина);
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				ТекстСообщенияПользователю,,
				"РегистрационныйНомерПФР",, Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Телефон) ИЛИ ЗначениеЗаполнено(АдресЭлектроннойПочты) Тогда
			Если НЕ ЗначениеЗаполнено(Телефон) И НЕ ЗначениеЗаполнено(АдресЭлектроннойПочты) Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не задан телефон индивидуального предпринимателя.'"),,
					"Телефон",, Отказ);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(АдресЭлектроннойПочты) И НЕ ЗначениеЗаполнено(Телефон) Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(
					НСтр("ru = 'Не задан адрес электронной почты индивидуального предпринимателя.'"),,
					"АдресЭлектроннойПочты",, Отказ);
			ИначеЕсли ЗначениеЗаполнено(АдресЭлектроннойПочты) Тогда
				ТекстОшибки = "";
				ЭлектроннаяПочта = СокрЛП(АдресЭлектроннойПочты);
				Если ДокументооборотСКОКлиентСервер.НайденыЗапрещенныеСимволы(
					ЭлектроннаяПочта,
					НСтр("ru = 'Адрес электронной почты '"),
					"АдресЭлектроннойПочты",
					Истина,
					ТекстОшибки) Тогда
					
					ОбщегоНазначенияКлиент.СообщитьПользователю((ТекстОшибки),,
						"АдресЭлектроннойПочты",, Отказ);
					
				ИначеЕсли НЕ ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(ЭлектроннаяПочта) Тогда
					
					Если НЕ СтрНайти(ЭлектроннаяПочта, "@") Тогда
						ОбщегоНазначенияКлиент.СообщитьПользователю(
							НСтр("ru = 'Некорректно указана электронная почта. Отсутствует символ @'"),,
							"АдресЭлектроннойПочты",, Отказ);
					Иначе
						ОбщегоНазначенияКлиент.СообщитьПользователю(
							НСтр("ru = 'Электронная почта содержит некорректные сочетания символов'"),,
							"АдресЭлектроннойПочты",, Отказ);
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru = 'Необходимо задать хотя бы один вид контактной информации.'"),,
				,, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НЕ Отказ;
	
КонецФункции

&НаКлиенте
Процедура ФИОНачалоВыбораЗавершение(РезультатРедактирования, ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(РезультатРедактирования) Тогда
		Возврат;
	КонецЕсли;
	
	Фамилия 	= РезультатРедактирования.Фамилия;
	Имя 		= РезультатРедактирования.Имя;
	Отчество 	= РезультатРедактирования.Отчество;
	
	ФИО = ДокументооборотСКОКлиентСервер.ПолучитьПредставлениеФИО(РезультатРедактирования);
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти
